Project/Toir.Adaptation/src/Reports/гкс_ФайлыДО/гкс_ФайлыДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3779a1fc-ad6e-4f88-bb69-ec4941cd5e38">
  <name>гкс_ФайлыДО</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="70a2260c-1102-406d-a73f-366c5f33449a">
    <name>АктыОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f517ba20-90d3-4020-8975-edcfbcc28340">
    <name>ВыявленныеДефекты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cf7199e7-3410-49ba-b6f8-344af3fa7a43">
    <name>ЗаявкиНаРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ee8d81b-1dd5-4db3-9c8d-96a203f50de2">
    <name>Период</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="78371f10-c5bc-4eed-902e-d0a4242db86d">
    <name>ТолькоСФайлами</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Report>

Project/Toir.Adaptation/src/Reports/гкс_ФайлыДО/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Отчет.Период.ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
	Отчет.Период.ДатаОкончания = ТекущаяДатаСеанса();
	Отчет.ВыявленныеДефекты = Истина;
	Отчет.АктыОВыполненииЭтапаРабот = Истина;
	Отчет.ЗаявкиНаРемонт = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ИсходныйПериод = Отчет.Период;
	
	Если Отчет.Период.ДатаОкончания = Дата(1, 1, 1) Тогда
		Отчет.Период.ДатаОкончания = ТекущаяДата();		
	КонецЕсли; 
	СекундВГоду = 31622399;
	Если (Отчет.Период.ДатаОкончания - Отчет.Период.ДатаНачала) > СекундВГоду Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(нСтр("ru='Период отчета не может превышать один год.'", "ru"), ,
													"Отчет.Период");
		Отчет.Период.ДатаНачала = НачалоГода(ТекущаяДата());
		Отчет.Период.ДатаОкончания = ТекущаяДата();
	КонецЕсли;       	
	
КонецПроцедуры

&НаСервере
Процедура ТолькСФайламиПриИзмененииНаСервере()
	
	ОтборПоФайламУстановлен = Ложь;
	ОтборФайлИД = Новый ПолеКомпоновкиДанных("ФайлИД");
	Для каждого ТекОтбор Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТекОтбор.ЛевоеЗначение = ОтборФайлИД Тогда
			Если Отчет.ТолькоСФайлами Тогда
				ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
				ТекОтбор.Использование = Истина;
			Иначе
				ТекОтбор.Использование = Ложь;
			КонецЕсли; 
			ОтборПоФайламУстановлен = Отчет.ТолькоСФайлами;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Не ОтборПоФайламУстановлен 
		И Отчет.ТолькоСФайлами Тогда
		НовыйЭлементОтбора 
			= Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение 
			= Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФайлИД")).Поле;
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькСФайламиПриИзменении(Элемент)
	ТолькСФайламиПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
